import pandas as pd

mydict = {
    '厦门大学': {'厦大总机：0592-2180000'},
    '厦门大学新闻网': {'项目批准号：22003051', '项目批准号：20720210092'},
    '厦门大学国际学术交流中心': {'总机：0592-2087988', '蔡清洁楼前台：0592-2180501', '逸夫楼咖啡厅：0592-2187380', '逸夫楼中餐厅：0592-2184552',
                     '科学艺术中心咖啡厅：0592-2188922', '逸夫楼西餐厅：0592-2186571', '会议专线：0592-2185115', '逸夫楼总台：0592-2182623'},
    '厦门大学国际学院': {'漳州校区联系电话：0596-6288108', '翔安校区联系电话：0592-2181672'},
    '厦门大学后勤集团': {'电话：0592-2187110'}
}
for key, val in mydict.items():
    mydict[key] = str(mydict[key])
# print(mydict)
df = pd.DataFrame(list(mydict.items()))
print(df)